app/views/favorites/_favorite.html.erb

<% if book.favorited_by?(current_user) %>
  <%= link_to "♥#{book.favorites.count}", book_favorites_path(book), method: :delete,class: "text-danger" %>
<% else%>
  <%= link_to "♥#{book.favorites.count}", book_favorites_path(book), method: :post,class: "text-primary" %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]