app/controllers/books_controller.rb

  def show
    @book = Book.find(params[:id])
    @user = User.find_by(id: @book.user_id)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "タイトル1"], ["body", "本文１"], ["user_id", 1], ["created_at", "2021-03-08 19:19:31.966923"], ["updated_at", "2021-03-08 19:19:31.966923"]]