app/controllers/book_comments_controller.rb

  def create
    @book = Book.find(params[:book_id])
    @book_comment = BookComment.new(book_comment_params)
    @book_comment.book_id = @book.id
    @book_comment.user_id = current_user.id
    @book_comment.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("user_id", "book_id", "created_at", "updated_at", "comment") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["created_at", "2021-03-09 08:00:23.295186"], ["updated_at", "2021-03-09 08:00:23.295186"], ["comment", "kfjdl;a"]]