app/models/user.rb

  def follow(user_id)
    relationships.create(followed_id: user_id)
---
INSERT INTO "relationships" ("follower_id", "followed_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["follower_id", 2], ["followed_id", 1], ["created_at", "2021-03-10 05:27:04.826395"], ["updated_at", "2021-03-10 05:27:04.826395"]]

  def unfollow(user_id)
    relationships.find_by(followed_id: user_id).destroy
---
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 2]]